my-app/server/artillery_tests/results/test3_afterCompositeIndex/qna_test_log.txt
Test run id: tmh3e_hb5x34kyetz6dzahyxbyxjz896478_49tx
Phase started: Testing Questions and Answers (index: 0, duration: 20s) 19:55:18(-0400)

Phase completed: Testing Questions and Answers (index: 0, duration: 20s) 19:55:38(-0400)

--------------------------------------
Metrics for period to: 19:55:20(-0400) (width: 0.265s)
--------------------------------------

http.codes.200: ................................................................ 5
http.downloaded_bytes: ......................................................... 4419
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 17
  median: ...................................................................... 7.9
  p95: ......................................................................... 13.1
  p99: ......................................................................... 13.1
http.responses: ................................................................ 5
vusers.completed: .............................................................. 5
vusers.created: ................................................................ 5
vusers.created_by_name.Get answers: ............................................ 3
vusers.created_by_name.Get questions: .......................................... 2
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 38.5
  max: ......................................................................... 64.3
  median: ...................................................................... 50.9
  p95: ......................................................................... 56.3
  p99: ......................................................................... 56.3


All VUs finished. Total time: 20 seconds

--------------------------------
Summary report @ 19:55:40(-0400)
--------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 131268
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 66
  median: ...................................................................... 4
  p95: ......................................................................... 34.8
  p99: ......................................................................... 53
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Get answers: ............................................ 51
vusers.created_by_name.Get questions: .......................................... 49
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7.7
  max: ......................................................................... 98.1
  median: ...................................................................... 25.3
  p95: ......................................................................... 64.7
  p99: ......................................................................... 96.6